HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN26 */
#define IFX_SCU_ACCEN0_EN26_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN26 */
#define IFX_SCU_ACCEN0_EN26_OFF (26)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN27 */
#define IFX_SCU_ACCEN0_EN27_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN27 */
#define IFX_SCU_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN27 */
#define IFX_SCU_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN28 */
#define IFX_SCU_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN28 */
#define IFX_SCU_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN28 */
#define IFX_SCU_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN29 */
#define IFX_SCU_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN29 */
#define IFX_SCU_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN29 */
#define IFX_SCU_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN2 */
#define IFX_SCU_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN2 */
#define IFX_SCU_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN2 */
#define IFX_SCU_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN30 */
#define IFX_SCU_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN30 */
#define IFX_SCU_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN30 */
#define IFX_SCU_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN31 */
#define IFX_SCU_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN31 */
#define IFX_SCU_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN31 */
#define IFX_SCU_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN3 */
#define IFX_SCU_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN3 */
#define IFX_SCU_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN3 */
#define IFX_SCU_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN4 */
#define IFX_SCU_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN4 */
#define IFX_SCU_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN4 */
#define IFX_SCU_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN5 */
#define IFX_SCU_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN5 */
#define IFX_SCU_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN5 */
#define IFX_SCU_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN6 */
#define IFX_SCU_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN6 */
#define IFX_SCU_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN6 */
#define IFX_SCU_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN7 */
#define IFX_SCU_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN7 */
#define IFX_SCU_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN7 */
#define IFX_SCU_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN8 */
#define IFX_SCU_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN8 */
#define IFX_SCU_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN8 */
#define IFX_SCU_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_SCU_ACCEN0_Bits.EN9 */
#define IFX_SCU_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_SCU_ACCEN0_Bits.EN9 */
#define IFX_SCU_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ACCEN0_Bits.EN9 */
#define IFX_SCU_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_SCU_ARSTDIS_Bits.STM0DIS */
#define IFX_SCU_ARSTDIS_STM0DIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_ARSTDIS_Bits.STM0DIS */
#define IFX_SCU_ARSTDIS_STM0DIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ARSTDIS_Bits.STM0DIS */
#define IFX_SCU_ARSTDIS_STM0DIS_OFF (0)

/** \\brief  Length for Ifx_SCU_ARSTDIS_Bits.STM1DIS */
#define IFX_SCU_ARSTDIS_STM1DIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_ARSTDIS_Bits.STM1DIS */
#define IFX_SCU_ARSTDIS_STM1DIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ARSTDIS_Bits.STM1DIS */
#define IFX_SCU_ARSTDIS_STM1DIS_OFF (1)

/** \\brief  Length for Ifx_SCU_ARSTDIS_Bits.STM2DIS */
#define IFX_SCU_ARSTDIS_STM2DIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_ARSTDIS_Bits.STM2DIS */
#define IFX_SCU_ARSTDIS_STM2DIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ARSTDIS_Bits.STM2DIS */
#define IFX_SCU_ARSTDIS_STM2DIS_OFF (2)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.CLKSEL */
#define IFX_SCU_CCUCON0_CLKSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.CLKSEL */
#define IFX_SCU_CCUCON0_CLKSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.CLKSEL */
#define IFX_SCU_CCUCON0_CLKSEL_OFF (28)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.CPU0DIV */
#define IFX_SCU_CCUCON0_CPU0DIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.CPU0DIV */
#define IFX_SCU_CCUCON0_CPU0DIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.CPU0DIV */
#define IFX_SCU_CCUCON0_CPU0DIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.CPU0FDR */
#define IFX_SCU_CCUCON0_CPU0FDR_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.CPU0FDR */
#define IFX_SCU_CCUCON0_CPU0FDR_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.CPU0FDR */
#define IFX_SCU_CCUCON0_CPU0FDR_OFF (4)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.FSI2DIV */
#define IFX_SCU_CCUCON0_FSI2DIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.FSI2DIV */
#define IFX_SCU_CCUCON0_FSI2DIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.FSI2DIV */
#define IFX_SCU_CCUCON0_FSI2DIV_OFF (20)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.FSIDIV */
#define IFX_SCU_CCUCON0_FSIDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.FSIDIV */
#define IFX_SCU_CCUCON0_FSIDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.FSIDIV */
#define IFX_SCU_CCUCON0_FSIDIV_OFF (24)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.LCK */
#define IFX_SCU_CCUCON0_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.LCK */
#define IFX_SCU_CCUCON0_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.LCK */
#define IFX_SCU_CCUCON0_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.SPBDIV */
#define IFX_SCU_CCUCON0_SPBDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.SPBDIV */
#define IFX_SCU_CCUCON0_SPBDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.SPBDIV */
#define IFX_SCU_CCUCON0_SPBDIV_OFF (16)

