HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.SRIDIV */
#define IFX_SCU_CCUCON0_SRIDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.SRIDIV */
#define IFX_SCU_CCUCON0_SRIDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.SRIDIV */
#define IFX_SCU_CCUCON0_SRIDIV_OFF (8)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.SRIFDR */
#define IFX_SCU_CCUCON0_SRIFDR_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.SRIFDR */
#define IFX_SCU_CCUCON0_SRIFDR_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.SRIFDR */
#define IFX_SCU_CCUCON0_SRIFDR_OFF (12)

/** \\brief  Length for Ifx_SCU_CCUCON0_Bits.UP */
#define IFX_SCU_CCUCON0_UP_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON0_Bits.UP */
#define IFX_SCU_CCUCON0_UP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON0_Bits.UP */
#define IFX_SCU_CCUCON0_UP_OFF (30)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.ERAYDIV */
#define IFX_SCU_CCUCON1_ERAYDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.ERAYDIV */
#define IFX_SCU_CCUCON1_ERAYDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.ERAYDIV */
#define IFX_SCU_CCUCON1_ERAYDIV_OFF (4)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.ETHDIV */
#define IFX_SCU_CCUCON1_ETHDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.ETHDIV */
#define IFX_SCU_CCUCON1_ETHDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.ETHDIV */
#define IFX_SCU_CCUCON1_ETHDIV_OFF (16)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.GTMDIV */
#define IFX_SCU_CCUCON1_GTMDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.GTMDIV */
#define IFX_SCU_CCUCON1_GTMDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.GTMDIV */
#define IFX_SCU_CCUCON1_GTMDIV_OFF (12)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.INSEL */
#define IFX_SCU_CCUCON1_INSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.INSEL */
#define IFX_SCU_CCUCON1_INSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.INSEL */
#define IFX_SCU_CCUCON1_INSEL_OFF (28)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.LCK */
#define IFX_SCU_CCUCON1_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.LCK */
#define IFX_SCU_CCUCON1_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.LCK */
#define IFX_SCU_CCUCON1_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.MAXDIV */
#define IFX_SCU_CCUCON1_MAXDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.MAXDIV */
#define IFX_SCU_CCUCON1_MAXDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.MAXDIV */
#define IFX_SCU_CCUCON1_MAXDIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.STMDIV */
#define IFX_SCU_CCUCON1_STMDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.STMDIV */
#define IFX_SCU_CCUCON1_STMDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.STMDIV */
#define IFX_SCU_CCUCON1_STMDIV_OFF (8)

/** \\brief  Length for Ifx_SCU_CCUCON1_Bits.UP */
#define IFX_SCU_CCUCON1_UP_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON1_Bits.UP */
#define IFX_SCU_CCUCON1_UP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON1_Bits.UP */
#define IFX_SCU_CCUCON1_UP_OFF (30)

/** \\brief  Length for Ifx_SCU_CCUCON2_Bits.BBBDIV */
#define IFX_SCU_CCUCON2_BBBDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON2_Bits.BBBDIV */
#define IFX_SCU_CCUCON2_BBBDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON2_Bits.BBBDIV */
#define IFX_SCU_CCUCON2_BBBDIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON2_Bits.LCK */
#define IFX_SCU_CCUCON2_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON2_Bits.LCK */
#define IFX_SCU_CCUCON2_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON2_Bits.LCK */
#define IFX_SCU_CCUCON2_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_CCUCON2_Bits.MCDSDIV */
#define IFX_SCU_CCUCON2_MCDSDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON2_Bits.MCDSDIV */
#define IFX_SCU_CCUCON2_MCDSDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON2_Bits.MCDSDIV */
#define IFX_SCU_CCUCON2_MCDSDIV_OFF (8)

/** \\brief  Length for Ifx_SCU_CCUCON2_Bits.REFCLKDIV */
#define IFX_SCU_CCUCON2_REFCLKDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON2_Bits.REFCLKDIV */
#define IFX_SCU_CCUCON2_REFCLKDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON2_Bits.REFCLKDIV */
#define IFX_SCU_CCUCON2_REFCLKDIV_OFF (4)

/** \\brief  Length for Ifx_SCU_CCUCON2_Bits.UP */
#define IFX_SCU_CCUCON2_UP_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON2_Bits.UP */
#define IFX_SCU_CCUCON2_UP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON2_Bits.UP */
#define IFX_SCU_CCUCON2_UP_OFF (30)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.LCK */
#define IFX_SCU_CCUCON3_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.LCK */
#define IFX_SCU_CCUCON3_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.LCK */
#define IFX_SCU_CCUCON3_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.PLLDIV */
#define IFX_SCU_CCUCON3_PLLDIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.PLLDIV */
#define IFX_SCU_CCUCON3_PLLDIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.PLLDIV */
#define IFX_SCU_CCUCON3_PLLDIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.PLLERAYDIV */
#define IFX_SCU_CCUCON3_PLLERAYDIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.PLLERAYDIV */
#define IFX_SCU_CCUCON3_PLLERAYDIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.PLLERAYDIV */
#define IFX_SCU_CCUCON3_PLLERAYDIV_OFF (8)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.PLLERAYSEL */
#define IFX_SCU_CCUCON3_PLLERAYSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.PLLERAYSEL */
#define IFX_SCU_CCUCON3_PLLERAYSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.PLLERAYSEL */
#define IFX_SCU_CCUCON3_PLLERAYSEL_OFF (14)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.PLLSEL */
#define IFX_SCU_CCUCON3_PLLSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.PLLSEL */
#define IFX_SCU_CCUCON3_PLLSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.PLLSEL */
#define IFX_SCU_CCUCON3_PLLSEL_OFF (6)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.SLCK */
#define IFX_SCU_CCUCON3_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.SLCK */
#define IFX_SCU_CCUCON3_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.SLCK */
#define IFX_SCU_CCUCON3_SLCK_OFF (29)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.SRIDIV */
#define IFX_SCU_CCUCON3_SRIDIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.SRIDIV */
#define IFX_SCU_CCUCON3_SRIDIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.SRIDIV */
#define IFX_SCU_CCUCON3_SRIDIV_OFF (16)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.SRISEL */
#define IFX_SCU_CCUCON3_SRISEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.SRISEL */
#define IFX_SCU_CCUCON3_SRISEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.SRISEL */
#define IFX_SCU_CCUCON3_SRISEL_OFF (22)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_LEN (1)

