HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_OFF (30)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.CPU0DIV */
#define IFX_SCU_CCUCON4_CPU0DIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.CPU0DIV */
#define IFX_SCU_CCUCON4_CPU0DIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.CPU0DIV */
#define IFX_SCU_CCUCON4_CPU0DIV_OFF (8)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.CPU0SEL */
#define IFX_SCU_CCUCON4_CPU0SEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.CPU0SEL */
#define IFX_SCU_CCUCON4_CPU0SEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.CPU0SEL */
#define IFX_SCU_CCUCON4_CPU0SEL_OFF (14)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.SLCK */
#define IFX_SCU_CCUCON4_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.SLCK */
#define IFX_SCU_CCUCON4_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.SLCK */
#define IFX_SCU_CCUCON4_SLCK_OFF (29)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.SPBDIV */
#define IFX_SCU_CCUCON4_SPBDIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.SPBDIV */
#define IFX_SCU_CCUCON4_SPBDIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.SPBDIV */
#define IFX_SCU_CCUCON4_SPBDIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.SPBSEL */
#define IFX_SCU_CCUCON4_SPBSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.SPBSEL */
#define IFX_SCU_CCUCON4_SPBSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.SPBSEL */
#define IFX_SCU_CCUCON4_SPBSEL_OFF (6)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.STMDIV */
#define IFX_SCU_CCUCON4_STMDIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.STMDIV */
#define IFX_SCU_CCUCON4_STMDIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.STMDIV */
#define IFX_SCU_CCUCON4_STMDIV_OFF (16)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.STMSEL */
#define IFX_SCU_CCUCON4_STMSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.STMSEL */
#define IFX_SCU_CCUCON4_STMSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.STMSEL */
#define IFX_SCU_CCUCON4_STMSEL_OFF (22)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_OFF (30)

/** \\brief  Length for Ifx_SCU_CCUCON5_Bits.EN */
#define IFX_SCU_CCUCON5_EN_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON5_Bits.EN */
#define IFX_SCU_CCUCON5_EN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON5_Bits.EN */
#define IFX_SCU_CCUCON5_EN_OFF (31)

/** \\brief  Length for Ifx_SCU_CCUCON5_Bits.OSC1REL */
#define IFX_SCU_CCUCON5_OSC1REL_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON5_Bits.OSC1REL */
#define IFX_SCU_CCUCON5_OSC1REL_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON5_Bits.OSC1REL */
#define IFX_SCU_CCUCON5_OSC1REL_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON5_Bits.SPBREL */
#define IFX_SCU_CCUCON5_SPBREL_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON5_Bits.SPBREL */
#define IFX_SCU_CCUCON5_SPBREL_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON5_Bits.SPBREL */
#define IFX_SCU_CCUCON5_SPBREL_OFF (8)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_LEN (8)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_OFF (8)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_OFF (0)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_LEN (2)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_OFF (6)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_LEN (1)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_OFF (16)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_LEN (4)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_OFF (24)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.SP */
#define IFX_SCU_CHIPID_SP_LEN (2)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.SP */
#define IFX_SCU_CHIPID_SP_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.SP */
#define IFX_SCU_CHIPID_SP_OFF (28)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_LEN (7)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_MSK (0x7f)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_OFF (17)

/** \\brief  Length for Ifx_SCU_DTSCON_Bits.BGTRIM */
#define IFX_SCU_DTSCON_BGTRIM_LEN (4)

/** \\brief  Mask for Ifx_SCU_DTSCON_Bits.BGTRIM */
#define IFX_SCU_DTSCON_BGTRIM_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_DTSCON_Bits.BGTRIM */
#define IFX_SCU_DTSCON_BGTRIM_OFF (21)

/** \\brief  Length for Ifx_SCU_DTSCON_Bits.GAIN */
#define IFX_SCU_DTSCON_GAIN_LEN (6)

/** \\brief  Mask for Ifx_SCU_DTSCON_Bits.GAIN */
#define IFX_SCU_DTSCON_GAIN_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_DTSCON_Bits.GAIN */
#define IFX_SCU_DTSCON_GAIN_OFF (12)

/** \\brief  Length for Ifx_SCU_DTSCON_Bits.LCK */
#define IFX_SCU_DTSCON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_DTSCON_Bits.LCK */
#define IFX_SCU_DTSCON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_DTSCON_Bits.LCK */
#define IFX_SCU_DTSCON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_DTSCON_Bits.OFFSET */
#define IFX_SCU_DTSCON_OFFSET_LEN (8)

/** \\brief  Mask for Ifx_SCU_DTSCON_Bits.OFFSET */
#define IFX_SCU_DTSCON_OFFSET_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_DTSCON_Bits.OFFSET */
#define IFX_SCU_DTSCON_OFFSET_OFF (4)

