HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_DTSCON_Bits.PWD */
#define IFX_SCU_DTSCON_PWD_LEN (1)

/** \\brief  Mask for Ifx_SCU_DTSCON_Bits.PWD */
#define IFX_SCU_DTSCON_PWD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_DTSCON_Bits.PWD */
#define IFX_SCU_DTSCON_PWD_OFF (0)

/** \\brief  Length for Ifx_SCU_DTSCON_Bits.REFTRIM */
#define IFX_SCU_DTSCON_REFTRIM_LEN (3)

/** \\brief  Mask for Ifx_SCU_DTSCON_Bits.REFTRIM */
#define IFX_SCU_DTSCON_REFTRIM_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_DTSCON_Bits.REFTRIM */
#define IFX_SCU_DTSCON_REFTRIM_OFF (18)

/** \\brief  Length for Ifx_SCU_DTSCON_Bits.START */
#define IFX_SCU_DTSCON_START_LEN (1)

/** \\brief  Mask for Ifx_SCU_DTSCON_Bits.START */
#define IFX_SCU_DTSCON_START_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_DTSCON_Bits.START */
#define IFX_SCU_DTSCON_START_OFF (1)

/** \\brief  Length for Ifx_SCU_DTSLIM_Bits.LCK */
#define IFX_SCU_DTSLIM_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_DTSLIM_Bits.LCK */
#define IFX_SCU_DTSLIM_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_DTSLIM_Bits.LCK */
#define IFX_SCU_DTSLIM_LCK_OFF (30)

/** \\brief  Length for Ifx_SCU_DTSLIM_Bits.LLU */
#define IFX_SCU_DTSLIM_LLU_LEN (1)

/** \\brief  Mask for Ifx_SCU_DTSLIM_Bits.LLU */
#define IFX_SCU_DTSLIM_LLU_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_DTSLIM_Bits.LLU */
#define IFX_SCU_DTSLIM_LLU_OFF (15)

/** \\brief  Length for Ifx_SCU_DTSLIM_Bits.LOWER */
#define IFX_SCU_DTSLIM_LOWER_LEN (10)

/** \\brief  Mask for Ifx_SCU_DTSLIM_Bits.LOWER */
#define IFX_SCU_DTSLIM_LOWER_MSK (0x3ff)

/** \\brief  Offset for Ifx_SCU_DTSLIM_Bits.LOWER */
#define IFX_SCU_DTSLIM_LOWER_OFF (0)

/** \\brief  Length for Ifx_SCU_DTSLIM_Bits.UOF */
#define IFX_SCU_DTSLIM_UOF_LEN (1)

/** \\brief  Mask for Ifx_SCU_DTSLIM_Bits.UOF */
#define IFX_SCU_DTSLIM_UOF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_DTSLIM_Bits.UOF */
#define IFX_SCU_DTSLIM_UOF_OFF (31)

/** \\brief  Length for Ifx_SCU_DTSLIM_Bits.UPPER */
#define IFX_SCU_DTSLIM_UPPER_LEN (10)

/** \\brief  Mask for Ifx_SCU_DTSLIM_Bits.UPPER */
#define IFX_SCU_DTSLIM_UPPER_MSK (0x3ff)

/** \\brief  Offset for Ifx_SCU_DTSLIM_Bits.UPPER */
#define IFX_SCU_DTSLIM_UPPER_OFF (16)

/** \\brief  Length for Ifx_SCU_DTSSTAT_Bits.BUSY */
#define IFX_SCU_DTSSTAT_BUSY_LEN (1)

/** \\brief  Mask for Ifx_SCU_DTSSTAT_Bits.BUSY */
#define IFX_SCU_DTSSTAT_BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_DTSSTAT_Bits.BUSY */
#define IFX_SCU_DTSSTAT_BUSY_OFF (15)

/** \\brief  Length for Ifx_SCU_DTSSTAT_Bits.RDY */
#define IFX_SCU_DTSSTAT_RDY_LEN (1)

/** \\brief  Mask for Ifx_SCU_DTSSTAT_Bits.RDY */
#define IFX_SCU_DTSSTAT_RDY_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_DTSSTAT_Bits.RDY */
#define IFX_SCU_DTSSTAT_RDY_OFF (14)

/** \\brief  Length for Ifx_SCU_DTSSTAT_Bits.RESULT */
#define IFX_SCU_DTSSTAT_RESULT_LEN (10)

/** \\brief  Mask for Ifx_SCU_DTSSTAT_Bits.RESULT */
#define IFX_SCU_DTSSTAT_RESULT_MSK (0x3ff)

/** \\brief  Offset for Ifx_SCU_DTSSTAT_Bits.RESULT */
#define IFX_SCU_DTSSTAT_RESULT_OFF (0)

/** \\brief  Length for Ifx_SCU_EICR_Bits.EIEN0 */
#define IFX_SCU_EICR_EIEN0_LEN (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.EIEN0 */
#define IFX_SCU_EICR_EIEN0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.EIEN0 */
#define IFX_SCU_EICR_EIEN0_OFF (11)

/** \\brief  Length for Ifx_SCU_EICR_Bits.EIEN1 */
#define IFX_SCU_EICR_EIEN1_LEN (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.EIEN1 */
#define IFX_SCU_EICR_EIEN1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.EIEN1 */
#define IFX_SCU_EICR_EIEN1_OFF (27)

/** \\brief  Length for Ifx_SCU_EICR_Bits.EXIS0 */
#define IFX_SCU_EICR_EXIS0_LEN (3)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.EXIS0 */
#define IFX_SCU_EICR_EXIS0_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.EXIS0 */
#define IFX_SCU_EICR_EXIS0_OFF (4)

/** \\brief  Length for Ifx_SCU_EICR_Bits.EXIS1 */
#define IFX_SCU_EICR_EXIS1_LEN (3)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.EXIS1 */
#define IFX_SCU_EICR_EXIS1_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.EXIS1 */
#define IFX_SCU_EICR_EXIS1_OFF (20)

/** \\brief  Length for Ifx_SCU_EICR_Bits.FEN0 */
#define IFX_SCU_EICR_FEN0_LEN (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.FEN0 */
#define IFX_SCU_EICR_FEN0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.FEN0 */
#define IFX_SCU_EICR_FEN0_OFF (8)

/** \\brief  Length for Ifx_SCU_EICR_Bits.FEN1 */
#define IFX_SCU_EICR_FEN1_LEN (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.FEN1 */
#define IFX_SCU_EICR_FEN1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.FEN1 */
#define IFX_SCU_EICR_FEN1_OFF (24)

/** \\brief  Length for Ifx_SCU_EICR_Bits.INP0 */
#define IFX_SCU_EICR_INP0_LEN (3)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.INP0 */
#define IFX_SCU_EICR_INP0_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.INP0 */
#define IFX_SCU_EICR_INP0_OFF (12)

/** \\brief  Length for Ifx_SCU_EICR_Bits.INP1 */
#define IFX_SCU_EICR_INP1_LEN (3)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.INP1 */
#define IFX_SCU_EICR_INP1_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.INP1 */
#define IFX_SCU_EICR_INP1_OFF (28)

/** \\brief  Length for Ifx_SCU_EICR_Bits.LDEN0 */
#define IFX_SCU_EICR_LDEN0_LEN (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.LDEN0 */
#define IFX_SCU_EICR_LDEN0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.LDEN0 */
#define IFX_SCU_EICR_LDEN0_OFF (10)

/** \\brief  Length for Ifx_SCU_EICR_Bits.LDEN1 */
#define IFX_SCU_EICR_LDEN1_LEN (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.LDEN1 */
#define IFX_SCU_EICR_LDEN1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.LDEN1 */
#define IFX_SCU_EICR_LDEN1_OFF (26)

/** \\brief  Length for Ifx_SCU_EICR_Bits.REN0 */
#define IFX_SCU_EICR_REN0_LEN (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.REN0 */
#define IFX_SCU_EICR_REN0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.REN0 */
#define IFX_SCU_EICR_REN0_OFF (9)

/** \\brief  Length for Ifx_SCU_EICR_Bits.REN1 */
#define IFX_SCU_EICR_REN1_LEN (1)

/** \\brief  Mask for Ifx_SCU_EICR_Bits.REN1 */
#define IFX_SCU_EICR_REN1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EICR_Bits.REN1 */
#define IFX_SCU_EICR_REN1_OFF (25)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF0 */
#define IFX_SCU_EIFR_INTF0_LEN (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF0 */
#define IFX_SCU_EIFR_INTF0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF0 */
#define IFX_SCU_EIFR_INTF0_OFF (0)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF1 */
#define IFX_SCU_EIFR_INTF1_LEN (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF1 */
#define IFX_SCU_EIFR_INTF1_MSK (0x1)

