HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF1 */
#define IFX_SCU_EIFR_INTF1_OFF (1)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF2 */
#define IFX_SCU_EIFR_INTF2_LEN (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF2 */
#define IFX_SCU_EIFR_INTF2_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF2 */
#define IFX_SCU_EIFR_INTF2_OFF (2)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF3 */
#define IFX_SCU_EIFR_INTF3_LEN (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF3 */
#define IFX_SCU_EIFR_INTF3_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF3 */
#define IFX_SCU_EIFR_INTF3_OFF (3)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF4 */
#define IFX_SCU_EIFR_INTF4_LEN (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF4 */
#define IFX_SCU_EIFR_INTF4_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF4 */
#define IFX_SCU_EIFR_INTF4_OFF (4)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF5 */
#define IFX_SCU_EIFR_INTF5_LEN (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF5 */
#define IFX_SCU_EIFR_INTF5_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF5 */
#define IFX_SCU_EIFR_INTF5_OFF (5)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF6 */
#define IFX_SCU_EIFR_INTF6_LEN (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF6 */
#define IFX_SCU_EIFR_INTF6_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF6 */
#define IFX_SCU_EIFR_INTF6_OFF (6)

/** \\brief  Length for Ifx_SCU_EIFR_Bits.INTF7 */
#define IFX_SCU_EIFR_INTF7_LEN (1)

/** \\brief  Mask for Ifx_SCU_EIFR_Bits.INTF7 */
#define IFX_SCU_EIFR_INTF7_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EIFR_Bits.INTF7 */
#define IFX_SCU_EIFR_INTF7_OFF (7)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.EMSF */
#define IFX_SCU_EMSR_EMSF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.EMSF */
#define IFX_SCU_EMSR_EMSF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.EMSF */
#define IFX_SCU_EMSR_EMSF_OFF (16)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.EMSFM */
#define IFX_SCU_EMSR_EMSFM_LEN (2)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.EMSFM */
#define IFX_SCU_EMSR_EMSFM_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.EMSFM */
#define IFX_SCU_EMSR_EMSFM_OFF (24)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.ENON */
#define IFX_SCU_EMSR_ENON_LEN (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.ENON */
#define IFX_SCU_EMSR_ENON_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.ENON */
#define IFX_SCU_EMSR_ENON_OFF (2)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.MODE */
#define IFX_SCU_EMSR_MODE_LEN (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.MODE */
#define IFX_SCU_EMSR_MODE_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.MODE */
#define IFX_SCU_EMSR_MODE_OFF (1)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.POL */
#define IFX_SCU_EMSR_POL_LEN (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.POL */
#define IFX_SCU_EMSR_POL_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.POL */
#define IFX_SCU_EMSR_POL_OFF (0)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.PSEL */
#define IFX_SCU_EMSR_PSEL_LEN (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.PSEL */
#define IFX_SCU_EMSR_PSEL_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.PSEL */
#define IFX_SCU_EMSR_PSEL_OFF (3)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.SEMSF */
#define IFX_SCU_EMSR_SEMSF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.SEMSF */
#define IFX_SCU_EMSR_SEMSF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.SEMSF */
#define IFX_SCU_EMSR_SEMSF_OFF (17)

/** \\brief  Length for Ifx_SCU_EMSR_Bits.SEMSFM */
#define IFX_SCU_EMSR_SEMSFM_LEN (2)

/** \\brief  Mask for Ifx_SCU_EMSR_Bits.SEMSFM */
#define IFX_SCU_EMSR_SEMSFM_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EMSR_Bits.SEMSFM */
#define IFX_SCU_EMSR_SEMSFM_OFF (26)

/** \\brief  Length for Ifx_SCU_ESRCFG_Bits.DFEN */
#define IFX_SCU_ESRCFG_DFEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_ESRCFG_Bits.DFEN */
#define IFX_SCU_ESRCFG_DFEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ESRCFG_Bits.DFEN */
#define IFX_SCU_ESRCFG_DFEN_OFF (4)

/** \\brief  Length for Ifx_SCU_ESRCFG_Bits.EDCON */
#define IFX_SCU_ESRCFG_EDCON_LEN (2)

/** \\brief  Mask for Ifx_SCU_ESRCFG_Bits.EDCON */
#define IFX_SCU_ESRCFG_EDCON_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_ESRCFG_Bits.EDCON */
#define IFX_SCU_ESRCFG_EDCON_OFF (7)

/** \\brief  Length for Ifx_SCU_ESRCFG_Bits.LCK */
#define IFX_SCU_ESRCFG_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_ESRCFG_Bits.LCK */
#define IFX_SCU_ESRCFG_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ESRCFG_Bits.LCK */
#define IFX_SCU_ESRCFG_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_LEN (1)

/** \\brief  Mask for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_OFF (1)

/** \\brief  Length for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_LEN (1)

/** \\brief  Mask for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_OFF (0)

/** \\brief  Length for Ifx_SCU_EVR13CON_Bits.BPEVR13OFF */
#define IFX_SCU_EVR13CON_BPEVR13OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVR13CON_Bits.BPEVR13OFF */
#define IFX_SCU_EVR13CON_BPEVR13OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVR13CON_Bits.BPEVR13OFF */
#define IFX_SCU_EVR13CON_BPEVR13OFF_OFF (29)

/** \\brief  Length for Ifx_SCU_EVR13CON_Bits.CTRL */
#define IFX_SCU_EVR13CON_CTRL_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR13CON_Bits.CTRL */
#define IFX_SCU_EVR13CON_CTRL_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR13CON_Bits.CTRL */
#define IFX_SCU_EVR13CON_CTRL_OFF (12)

/** \\brief  Length for Ifx_SCU_EVR13CON_Bits.EVR13OFF */
#define IFX_SCU_EVR13CON_EVR13OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVR13CON_Bits.EVR13OFF */
#define IFX_SCU_EVR13CON_EVR13OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVR13CON_Bits.EVR13OFF */
#define IFX_SCU_EVR13CON_EVR13OFF_OFF (28)

/** \\brief  Length for Ifx_SCU_EVR13CON_Bits.KD */
#define IFX_SCU_EVR13CON_KD_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR13CON_Bits.KD */
#define IFX_SCU_EVR13CON_KD_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR13CON_Bits.KD */
#define IFX_SCU_EVR13CON_KD_OFF (8)

/** \\brief  Length for Ifx_SCU_EVR13CON_Bits.KDE */
#define IFX_SCU_EVR13CON_KDE_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR13CON_Bits.KDE */
#define IFX_SCU_EVR13CON_KDE_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR13CON_Bits.KDE */
#define IFX_SCU_EVR13CON_KDE_OFF (24)

/** \\brief  Length for Ifx_SCU_EVR13CON_Bits.KI */
#define IFX_SCU_EVR13CON_KI_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR13CON_Bits.KI */
#define IFX_SCU_EVR13CON_KI_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR13CON_Bits.KI */
#define IFX_SCU_EVR13CON_KI_OFF (4)

/** \\brief  Length for Ifx_SCU_EVR13CON_Bits.KIE */
#define IFX_SCU_EVR13CON_KIE_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR13CON_Bits.KIE */
#define IFX_SCU_EVR13CON_KIE_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR13CON_Bits.KIE */
#define IFX_SCU_EVR13CON_KIE_OFF (20)

