HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_EVR13CON_Bits.KP */
#define IFX_SCU_EVR13CON_KP_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR13CON_Bits.KP */
#define IFX_SCU_EVR13CON_KP_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR13CON_Bits.KP */
#define IFX_SCU_EVR13CON_KP_OFF (0)

/** \\brief  Length for Ifx_SCU_EVR13CON_Bits.KPE */
#define IFX_SCU_EVR13CON_KPE_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR13CON_Bits.KPE */
#define IFX_SCU_EVR13CON_KPE_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR13CON_Bits.KPE */
#define IFX_SCU_EVR13CON_KPE_OFF (16)

/** \\brief  Length for Ifx_SCU_EVR13CON_Bits.LCK */
#define IFX_SCU_EVR13CON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVR13CON_Bits.LCK */
#define IFX_SCU_EVR13CON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVR13CON_Bits.LCK */
#define IFX_SCU_EVR13CON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVR33CON_Bits.BPEVR33OFF */
#define IFX_SCU_EVR33CON_BPEVR33OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVR33CON_Bits.BPEVR33OFF */
#define IFX_SCU_EVR33CON_BPEVR33OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVR33CON_Bits.BPEVR33OFF */
#define IFX_SCU_EVR33CON_BPEVR33OFF_OFF (29)

/** \\brief  Length for Ifx_SCU_EVR33CON_Bits.CTRL */
#define IFX_SCU_EVR33CON_CTRL_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR33CON_Bits.CTRL */
#define IFX_SCU_EVR33CON_CTRL_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR33CON_Bits.CTRL */
#define IFX_SCU_EVR33CON_CTRL_OFF (12)

/** \\brief  Length for Ifx_SCU_EVR33CON_Bits.EVR33OFF */
#define IFX_SCU_EVR33CON_EVR33OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVR33CON_Bits.EVR33OFF */
#define IFX_SCU_EVR33CON_EVR33OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVR33CON_Bits.EVR33OFF */
#define IFX_SCU_EVR33CON_EVR33OFF_OFF (28)

/** \\brief  Length for Ifx_SCU_EVR33CON_Bits.KD */
#define IFX_SCU_EVR33CON_KD_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR33CON_Bits.KD */
#define IFX_SCU_EVR33CON_KD_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR33CON_Bits.KD */
#define IFX_SCU_EVR33CON_KD_OFF (8)

/** \\brief  Length for Ifx_SCU_EVR33CON_Bits.KDE */
#define IFX_SCU_EVR33CON_KDE_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR33CON_Bits.KDE */
#define IFX_SCU_EVR33CON_KDE_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR33CON_Bits.KDE */
#define IFX_SCU_EVR33CON_KDE_OFF (24)

/** \\brief  Length for Ifx_SCU_EVR33CON_Bits.KI */
#define IFX_SCU_EVR33CON_KI_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR33CON_Bits.KI */
#define IFX_SCU_EVR33CON_KI_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR33CON_Bits.KI */
#define IFX_SCU_EVR33CON_KI_OFF (4)

/** \\brief  Length for Ifx_SCU_EVR33CON_Bits.KIE */
#define IFX_SCU_EVR33CON_KIE_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR33CON_Bits.KIE */
#define IFX_SCU_EVR33CON_KIE_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR33CON_Bits.KIE */
#define IFX_SCU_EVR33CON_KIE_OFF (20)

/** \\brief  Length for Ifx_SCU_EVR33CON_Bits.KP */
#define IFX_SCU_EVR33CON_KP_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR33CON_Bits.KP */
#define IFX_SCU_EVR33CON_KP_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR33CON_Bits.KP */
#define IFX_SCU_EVR33CON_KP_OFF (0)

/** \\brief  Length for Ifx_SCU_EVR33CON_Bits.KPE */
#define IFX_SCU_EVR33CON_KPE_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVR33CON_Bits.KPE */
#define IFX_SCU_EVR33CON_KPE_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVR33CON_Bits.KPE */
#define IFX_SCU_EVR33CON_KPE_OFF (16)

/** \\brief  Length for Ifx_SCU_EVR33CON_Bits.LCK */
#define IFX_SCU_EVR33CON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVR33CON_Bits.LCK */
#define IFX_SCU_EVR33CON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVR33CON_Bits.LCK */
#define IFX_SCU_EVR33CON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRADCSTAT_Bits.ADC13V */
#define IFX_SCU_EVRADCSTAT_ADC13V_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.ADC13V */
#define IFX_SCU_EVRADCSTAT_ADC13V_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.ADC13V */
#define IFX_SCU_EVRADCSTAT_ADC13V_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRADCSTAT_Bits.ADC33V */
#define IFX_SCU_EVRADCSTAT_ADC33V_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.ADC33V */
#define IFX_SCU_EVRADCSTAT_ADC33V_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.ADC33V */
#define IFX_SCU_EVRADCSTAT_ADC33V_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_OFF (4)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR33OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33OVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR33OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33OVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR33OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33OVMOD_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_OFF (12)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_LEN (1)

