HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_OFF (30)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_OFF (20)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_OFF (0)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_OFF (8)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_OFF (30)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.BPRST13OFF */
#define IFX_SCU_EVRRSTCON_BPRST13OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.BPRST13OFF */
#define IFX_SCU_EVRRSTCON_BPRST13OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.BPRST13OFF */
#define IFX_SCU_EVRRSTCON_BPRST13OFF_OFF (25)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_OFF (27)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_OFF (29)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.RST13OFF */
#define IFX_SCU_EVRRSTCON_RST13OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.RST13OFF */
#define IFX_SCU_EVRRSTCON_RST13OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.RST13OFF */
#define IFX_SCU_EVRRSTCON_RST13OFF_OFF (24)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.RST13TRIM */
#define IFX_SCU_EVRRSTCON_RST13TRIM_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.RST13TRIM */
#define IFX_SCU_EVRRSTCON_RST13TRIM_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.RST13TRIM */
#define IFX_SCU_EVRRSTCON_RST13TRIM_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.RST33OFF */
#define IFX_SCU_EVRRSTCON_RST33OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.RST33OFF */
#define IFX_SCU_EVRRSTCON_RST33OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.RST33OFF */
#define IFX_SCU_EVRRSTCON_RST33OFF_OFF (26)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.RST33TRIM */
#define IFX_SCU_EVRRSTCON_RST33TRIM_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.RST33TRIM */
#define IFX_SCU_EVRRSTCON_RST33TRIM_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.RST33TRIM */
#define IFX_SCU_EVRRSTCON_RST33TRIM_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_OFF (28)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.RSTSWDTRIM */
#define IFX_SCU_EVRRSTCON_RSTSWDTRIM_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.RSTSWDTRIM */
#define IFX_SCU_EVRRSTCON_RSTSWDTRIM_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.RSTSWDTRIM */
#define IFX_SCU_EVRRSTCON_RSTSWDTRIM_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.SLCK */
#define IFX_SCU_EVRRSTCON_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.SLCK */
#define IFX_SCU_EVRRSTCON_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.SLCK */
#define IFX_SCU_EVRRSTCON_SLCK_OFF (30)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_LEN (16)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_MSK (0xffff)

