HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_IOCR_Bits.PC0 */
#define IFX_SCU_IOCR_PC0_OFF (4)

/** \\brief  Length for Ifx_SCU_IOCR_Bits.PC1 */
#define IFX_SCU_IOCR_PC1_LEN (4)

/** \\brief  Mask for Ifx_SCU_IOCR_Bits.PC1 */
#define IFX_SCU_IOCR_PC1_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_IOCR_Bits.PC1 */
#define IFX_SCU_IOCR_PC1_OFF (12)

/** \\brief  Length for Ifx_SCU_LBISTCTRL0_Bits.BODY */
#define IFX_SCU_LBISTCTRL0_BODY_LEN (1)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL0_Bits.BODY */
#define IFX_SCU_LBISTCTRL0_BODY_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL0_Bits.BODY */
#define IFX_SCU_LBISTCTRL0_BODY_OFF (31)

/** \\brief  Length for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQ */
#define IFX_SCU_LBISTCTRL0_LBISTREQ_LEN (1)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQ */
#define IFX_SCU_LBISTCTRL0_LBISTREQ_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQ */
#define IFX_SCU_LBISTCTRL0_LBISTREQ_OFF (0)

/** \\brief  Length for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQP */
#define IFX_SCU_LBISTCTRL0_LBISTREQP_LEN (1)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQP */
#define IFX_SCU_LBISTCTRL0_LBISTREQP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQP */
#define IFX_SCU_LBISTCTRL0_LBISTREQP_OFF (1)

/** \\brief  Length for Ifx_SCU_LBISTCTRL0_Bits.PATTERNS */
#define IFX_SCU_LBISTCTRL0_PATTERNS_LEN (14)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL0_Bits.PATTERNS */
#define IFX_SCU_LBISTCTRL0_PATTERNS_MSK (0x3fff)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL0_Bits.PATTERNS */
#define IFX_SCU_LBISTCTRL0_PATTERNS_OFF (2)

/** \\brief  Length for Ifx_SCU_LBISTCTRL0_Bits.SEED */
#define IFX_SCU_LBISTCTRL0_SEED_LEN (15)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL0_Bits.SEED */
#define IFX_SCU_LBISTCTRL0_SEED_MSK (0x7fff)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL0_Bits.SEED */
#define IFX_SCU_LBISTCTRL0_SEED_OFF (16)

/** \\brief  Length for Ifx_SCU_LBISTCTRL1_Bits.LBISTDONE */
#define IFX_SCU_LBISTCTRL1_LBISTDONE_LEN (1)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL1_Bits.LBISTDONE */
#define IFX_SCU_LBISTCTRL1_LBISTDONE_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL1_Bits.LBISTDONE */
#define IFX_SCU_LBISTCTRL1_LBISTDONE_OFF (27)

/** \\brief  Length for Ifx_SCU_LBISTCTRL1_Bits.LBISTFREQ */
#define IFX_SCU_LBISTCTRL1_LBISTFREQ_LEN (4)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL1_Bits.LBISTFREQ */
#define IFX_SCU_LBISTCTRL1_LBISTFREQ_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL1_Bits.LBISTFREQ */
#define IFX_SCU_LBISTCTRL1_LBISTFREQ_OFF (28)

/** \\brief  Length for Ifx_SCU_LBISTCTRL1_Bits.SIGNATURE */
#define IFX_SCU_LBISTCTRL1_SIGNATURE_LEN (24)

/** \\brief  Mask for Ifx_SCU_LBISTCTRL1_Bits.SIGNATURE */
#define IFX_SCU_LBISTCTRL1_SIGNATURE_MSK (0xffffff)

/** \\brief  Offset for Ifx_SCU_LBISTCTRL1_Bits.SIGNATURE */
#define IFX_SCU_LBISTCTRL1_SIGNATURE_OFF (0)

/** \\brief  Length for Ifx_SCU_LCLCON_Bits.LS */
#define IFX_SCU_LCLCON_LS_LEN (1)

/** \\brief  Mask for Ifx_SCU_LCLCON_Bits.LS */
#define IFX_SCU_LCLCON_LS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_LCLCON_Bits.LS */
#define IFX_SCU_LCLCON_LS_OFF (16)

/** \\brief  Length for Ifx_SCU_LCLCON_Bits.LSEN */
#define IFX_SCU_LCLCON_LSEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_LCLCON_Bits.LSEN */
#define IFX_SCU_LCLCON_LSEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_LCLCON_Bits.LSEN */
#define IFX_SCU_LCLCON_LSEN_OFF (31)

/** \\brief  Length for Ifx_SCU_MANID_Bits.DEPT */
#define IFX_SCU_MANID_DEPT_LEN (5)

/** \\brief  Mask for Ifx_SCU_MANID_Bits.DEPT */
#define IFX_SCU_MANID_DEPT_MSK (0x1f)

/** \\brief  Offset for Ifx_SCU_MANID_Bits.DEPT */
#define IFX_SCU_MANID_DEPT_OFF (0)

/** \\brief  Length for Ifx_SCU_MANID_Bits.MANUF */
#define IFX_SCU_MANID_MANUF_LEN (11)

/** \\brief  Mask for Ifx_SCU_MANID_Bits.MANUF */
#define IFX_SCU_MANID_MANUF_MSK (0x7ff)

/** \\brief  Offset for Ifx_SCU_MANID_Bits.MANUF */
#define IFX_SCU_MANID_MANUF_OFF (5)

/** \\brief  Length for Ifx_SCU_OMR_Bits.PCL0 */
#define IFX_SCU_OMR_PCL0_LEN (1)

/** \\brief  Mask for Ifx_SCU_OMR_Bits.PCL0 */
#define IFX_SCU_OMR_PCL0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_OMR_Bits.PCL0 */
#define IFX_SCU_OMR_PCL0_OFF (16)

/** \\brief  Length for Ifx_SCU_OMR_Bits.PCL1 */
#define IFX_SCU_OMR_PCL1_LEN (1)

/** \\brief  Mask for Ifx_SCU_OMR_Bits.PCL1 */
#define IFX_SCU_OMR_PCL1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_OMR_Bits.PCL1 */
#define IFX_SCU_OMR_PCL1_OFF (17)

/** \\brief  Length for Ifx_SCU_OMR_Bits.PS0 */
#define IFX_SCU_OMR_PS0_LEN (1)

/** \\brief  Mask for Ifx_SCU_OMR_Bits.PS0 */
#define IFX_SCU_OMR_PS0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_OMR_Bits.PS0 */
#define IFX_SCU_OMR_PS0_OFF (0)

/** \\brief  Length for Ifx_SCU_OMR_Bits.PS1 */
#define IFX_SCU_OMR_PS1_LEN (1)

/** \\brief  Mask for Ifx_SCU_OMR_Bits.PS1 */
#define IFX_SCU_OMR_PS1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_OMR_Bits.PS1 */
#define IFX_SCU_OMR_PS1_OFF (1)

/** \\brief  Length for Ifx_SCU_OSCCON_Bits.APREN */
#define IFX_SCU_OSCCON_APREN_LEN (1)

/** \\brief  Mask for Ifx_SCU_OSCCON_Bits.APREN */
#define IFX_SCU_OSCCON_APREN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_OSCCON_Bits.APREN */
#define IFX_SCU_OSCCON_APREN_OFF (23)

/** \\brief  Length for Ifx_SCU_OSCCON_Bits.CAP0EN */
#define IFX_SCU_OSCCON_CAP0EN_LEN (1)

/** \\brief  Mask for Ifx_SCU_OSCCON_Bits.CAP0EN */
#define IFX_SCU_OSCCON_CAP0EN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_OSCCON_Bits.CAP0EN */
#define IFX_SCU_OSCCON_CAP0EN_OFF (24)

/** \\brief  Length for Ifx_SCU_OSCCON_Bits.CAP1EN */
#define IFX_SCU_OSCCON_CAP1EN_LEN (1)

/** \\brief  Mask for Ifx_SCU_OSCCON_Bits.CAP1EN */
#define IFX_SCU_OSCCON_CAP1EN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_OSCCON_Bits.CAP1EN */
#define IFX_SCU_OSCCON_CAP1EN_OFF (25)

/** \\brief  Length for Ifx_SCU_OSCCON_Bits.CAP2EN */
#define IFX_SCU_OSCCON_CAP2EN_LEN (1)

/** \\brief  Mask for Ifx_SCU_OSCCON_Bits.CAP2EN */
#define IFX_SCU_OSCCON_CAP2EN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_OSCCON_Bits.CAP2EN */
#define IFX_SCU_OSCCON_CAP2EN_OFF (26)

/** \\brief  Length for Ifx_SCU_OSCCON_Bits.CAP3EN */
#define IFX_SCU_OSCCON_CAP3EN_LEN (1)

/** \\brief  Mask for Ifx_SCU_OSCCON_Bits.CAP3EN */
#define IFX_SCU_OSCCON_CAP3EN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_OSCCON_Bits.CAP3EN */
#define IFX_SCU_OSCCON_CAP3EN_OFF (27)

