HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_OVCENABLE_Bits.OVEN2 */
#define IFX_SCU_OVCENABLE_OVEN2_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_OVCENABLE_Bits.OVEN2 */
#define IFX_SCU_OVCENABLE_OVEN2_OFF (2)

/** \\brief  Length for Ifx_SCU_PDISC_Bits.PDIS0 */
#define IFX_SCU_PDISC_PDIS0_LEN (1)

/** \\brief  Mask for Ifx_SCU_PDISC_Bits.PDIS0 */
#define IFX_SCU_PDISC_PDIS0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PDISC_Bits.PDIS0 */
#define IFX_SCU_PDISC_PDIS0_OFF (0)

/** \\brief  Length for Ifx_SCU_PDISC_Bits.PDIS1 */
#define IFX_SCU_PDISC_PDIS1_LEN (1)

/** \\brief  Mask for Ifx_SCU_PDISC_Bits.PDIS1 */
#define IFX_SCU_PDISC_PDIS1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PDISC_Bits.PDIS1 */
#define IFX_SCU_PDISC_PDIS1_OFF (1)

/** \\brief  Length for Ifx_SCU_PDRR_Bits.PDR0 */
#define IFX_SCU_PDRR_PDR0_LEN (1)

/** \\brief  Mask for Ifx_SCU_PDRR_Bits.PDR0 */
#define IFX_SCU_PDRR_PDR0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PDRR_Bits.PDR0 */
#define IFX_SCU_PDRR_PDR0_OFF (0)

/** \\brief  Length for Ifx_SCU_PDRR_Bits.PDR1 */
#define IFX_SCU_PDRR_PDR1_LEN (1)

/** \\brief  Mask for Ifx_SCU_PDRR_Bits.PDR1 */
#define IFX_SCU_PDRR_PDR1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PDRR_Bits.PDR1 */
#define IFX_SCU_PDRR_PDR1_OFF (1)

/** \\brief  Length for Ifx_SCU_PDRR_Bits.PDR2 */
#define IFX_SCU_PDRR_PDR2_LEN (1)

/** \\brief  Mask for Ifx_SCU_PDRR_Bits.PDR2 */
#define IFX_SCU_PDRR_PDR2_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PDRR_Bits.PDR2 */
#define IFX_SCU_PDRR_PDR2_OFF (2)

/** \\brief  Length for Ifx_SCU_PDRR_Bits.PDR3 */
#define IFX_SCU_PDRR_PDR3_LEN (1)

/** \\brief  Mask for Ifx_SCU_PDRR_Bits.PDR3 */
#define IFX_SCU_PDRR_PDR3_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PDRR_Bits.PDR3 */
#define IFX_SCU_PDRR_PDR3_OFF (3)

/** \\brief  Length for Ifx_SCU_PDRR_Bits.PDR4 */
#define IFX_SCU_PDRR_PDR4_LEN (1)

/** \\brief  Mask for Ifx_SCU_PDRR_Bits.PDR4 */
#define IFX_SCU_PDRR_PDR4_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PDRR_Bits.PDR4 */
#define IFX_SCU_PDRR_PDR4_OFF (4)

/** \\brief  Length for Ifx_SCU_PDRR_Bits.PDR5 */
#define IFX_SCU_PDRR_PDR5_LEN (1)

/** \\brief  Mask for Ifx_SCU_PDRR_Bits.PDR5 */
#define IFX_SCU_PDRR_PDR5_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PDRR_Bits.PDR5 */
#define IFX_SCU_PDRR_PDR5_OFF (5)

/** \\brief  Length for Ifx_SCU_PDRR_Bits.PDR6 */
#define IFX_SCU_PDRR_PDR6_LEN (1)

/** \\brief  Mask for Ifx_SCU_PDRR_Bits.PDR6 */
#define IFX_SCU_PDRR_PDR6_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PDRR_Bits.PDR6 */
#define IFX_SCU_PDRR_PDR6_OFF (6)

/** \\brief  Length for Ifx_SCU_PDRR_Bits.PDR7 */
#define IFX_SCU_PDRR_PDR7_LEN (1)

/** \\brief  Mask for Ifx_SCU_PDRR_Bits.PDR7 */
#define IFX_SCU_PDRR_PDR7_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PDRR_Bits.PDR7 */
#define IFX_SCU_PDRR_PDR7_OFF (7)

/** \\brief  Length for Ifx_SCU_PLLCON0_Bits.CEN */
#define IFX_SCU_PLLCON0_CEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLCON0_Bits.CEN */
#define IFX_SCU_PLLCON0_CEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLCON0_Bits.CEN */
#define IFX_SCU_PLLCON0_CEN_OFF (3)

/** \\brief  Length for Ifx_SCU_PLLCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLCON0_CLRFINDIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLCON0_CLRFINDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLCON0_CLRFINDIS_OFF (5)

/** \\brief  Length for Ifx_SCU_PLLCON0_Bits.MODEN */
#define IFX_SCU_PLLCON0_MODEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLCON0_Bits.MODEN */
#define IFX_SCU_PLLCON0_MODEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLCON0_Bits.MODEN */
#define IFX_SCU_PLLCON0_MODEN_OFF (2)

/** \\brief  Length for Ifx_SCU_PLLCON0_Bits.NDIV */
#define IFX_SCU_PLLCON0_NDIV_LEN (7)

/** \\brief  Mask for Ifx_SCU_PLLCON0_Bits.NDIV */
#define IFX_SCU_PLLCON0_NDIV_MSK (0x7f)

/** \\brief  Offset for Ifx_SCU_PLLCON0_Bits.NDIV */
#define IFX_SCU_PLLCON0_NDIV_OFF (9)

/** \\brief  Length for Ifx_SCU_PLLCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLCON0_OSCDISCDIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLCON0_OSCDISCDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLCON0_OSCDISCDIS_OFF (6)

/** \\brief  Length for Ifx_SCU_PLLCON0_Bits.PDIV */
#define IFX_SCU_PLLCON0_PDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_PLLCON0_Bits.PDIV */
#define IFX_SCU_PLLCON0_PDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_PLLCON0_Bits.PDIV */
#define IFX_SCU_PLLCON0_PDIV_OFF (24)

/** \\brief  Length for Ifx_SCU_PLLCON0_Bits.PLLPWD */
#define IFX_SCU_PLLCON0_PLLPWD_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLCON0_Bits.PLLPWD */
#define IFX_SCU_PLLCON0_PLLPWD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLCON0_Bits.PLLPWD */
#define IFX_SCU_PLLCON0_PLLPWD_OFF (16)

/** \\brief  Length for Ifx_SCU_PLLCON0_Bits.RESLD */
#define IFX_SCU_PLLCON0_RESLD_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLCON0_Bits.RESLD */
#define IFX_SCU_PLLCON0_RESLD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLCON0_Bits.RESLD */
#define IFX_SCU_PLLCON0_RESLD_OFF (18)

/** \\brief  Length for Ifx_SCU_PLLCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLCON0_SETFINDIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLCON0_SETFINDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLCON0_SETFINDIS_OFF (4)

/** \\brief  Length for Ifx_SCU_PLLCON0_Bits.VCOBYP */
#define IFX_SCU_PLLCON0_VCOBYP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLCON0_Bits.VCOBYP */
#define IFX_SCU_PLLCON0_VCOBYP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLCON0_Bits.VCOBYP */
#define IFX_SCU_PLLCON0_VCOBYP_OFF (0)

/** \\brief  Length for Ifx_SCU_PLLCON0_Bits.VCOPWD */
#define IFX_SCU_PLLCON0_VCOPWD_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLCON0_Bits.VCOPWD */
#define IFX_SCU_PLLCON0_VCOPWD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLCON0_Bits.VCOPWD */
#define IFX_SCU_PLLCON0_VCOPWD_OFF (1)

/** \\brief  Length for Ifx_SCU_PLLCON1_Bits.K1DIV */
#define IFX_SCU_PLLCON1_K1DIV_LEN (7)

/** \\brief  Mask for Ifx_SCU_PLLCON1_Bits.K1DIV */
#define IFX_SCU_PLLCON1_K1DIV_MSK (0x7f)

/** \\brief  Offset for Ifx_SCU_PLLCON1_Bits.K1DIV */
#define IFX_SCU_PLLCON1_K1DIV_OFF (16)

