HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_PLLCON1_Bits.K2DIV */
#define IFX_SCU_PLLCON1_K2DIV_LEN (7)

/** \\brief  Mask for Ifx_SCU_PLLCON1_Bits.K2DIV */
#define IFX_SCU_PLLCON1_K2DIV_MSK (0x7f)

/** \\brief  Offset for Ifx_SCU_PLLCON1_Bits.K2DIV */
#define IFX_SCU_PLLCON1_K2DIV_OFF (0)

/** \\brief  Length for Ifx_SCU_PLLCON2_Bits.MODAMP */
#define IFX_SCU_PLLCON2_MODAMP_LEN (16)

/** \\brief  Mask for Ifx_SCU_PLLCON2_Bits.MODAMP */
#define IFX_SCU_PLLCON2_MODAMP_MSK (0xffff)

/** \\brief  Offset for Ifx_SCU_PLLCON2_Bits.MODAMP */
#define IFX_SCU_PLLCON2_MODAMP_OFF (0)

/** \\brief  Length for Ifx_SCU_PLLCON2_Bits.MODFREQ */
#define IFX_SCU_PLLCON2_MODFREQ_LEN (16)

/** \\brief  Mask for Ifx_SCU_PLLCON2_Bits.MODFREQ */
#define IFX_SCU_PLLCON2_MODFREQ_MSK (0xffff)

/** \\brief  Offset for Ifx_SCU_PLLCON2_Bits.MODFREQ */
#define IFX_SCU_PLLCON2_MODFREQ_OFF (16)

/** \\brief  Length for Ifx_SCU_PLLERAYCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLERAYCON0_CLRFINDIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLERAYCON0_CLRFINDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLERAYCON0_CLRFINDIS_OFF (5)

/** \\brief  Length for Ifx_SCU_PLLERAYCON0_Bits.NDIV */
#define IFX_SCU_PLLERAYCON0_NDIV_LEN (5)

/** \\brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.NDIV */
#define IFX_SCU_PLLERAYCON0_NDIV_MSK (0x1f)

/** \\brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.NDIV */
#define IFX_SCU_PLLERAYCON0_NDIV_OFF (9)

/** \\brief  Length for Ifx_SCU_PLLERAYCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLERAYCON0_OSCDISCDIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLERAYCON0_OSCDISCDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLERAYCON0_OSCDISCDIS_OFF (6)

/** \\brief  Length for Ifx_SCU_PLLERAYCON0_Bits.PDIV */
#define IFX_SCU_PLLERAYCON0_PDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.PDIV */
#define IFX_SCU_PLLERAYCON0_PDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.PDIV */
#define IFX_SCU_PLLERAYCON0_PDIV_OFF (24)

/** \\brief  Length for Ifx_SCU_PLLERAYCON0_Bits.PLLPWD */
#define IFX_SCU_PLLERAYCON0_PLLPWD_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.PLLPWD */
#define IFX_SCU_PLLERAYCON0_PLLPWD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.PLLPWD */
#define IFX_SCU_PLLERAYCON0_PLLPWD_OFF (16)

/** \\brief  Length for Ifx_SCU_PLLERAYCON0_Bits.RESLD */
#define IFX_SCU_PLLERAYCON0_RESLD_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.RESLD */
#define IFX_SCU_PLLERAYCON0_RESLD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.RESLD */
#define IFX_SCU_PLLERAYCON0_RESLD_OFF (18)

/** \\brief  Length for Ifx_SCU_PLLERAYCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLERAYCON0_SETFINDIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLERAYCON0_SETFINDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLERAYCON0_SETFINDIS_OFF (4)

/** \\brief  Length for Ifx_SCU_PLLERAYCON0_Bits.VCOBYP */
#define IFX_SCU_PLLERAYCON0_VCOBYP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.VCOBYP */
#define IFX_SCU_PLLERAYCON0_VCOBYP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.VCOBYP */
#define IFX_SCU_PLLERAYCON0_VCOBYP_OFF (0)

/** \\brief  Length for Ifx_SCU_PLLERAYCON0_Bits.VCOPWD */
#define IFX_SCU_PLLERAYCON0_VCOPWD_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.VCOPWD */
#define IFX_SCU_PLLERAYCON0_VCOPWD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.VCOPWD */
#define IFX_SCU_PLLERAYCON0_VCOPWD_OFF (1)

/** \\brief  Length for Ifx_SCU_PLLERAYCON1_Bits.K1DIV */
#define IFX_SCU_PLLERAYCON1_K1DIV_LEN (7)

/** \\brief  Mask for Ifx_SCU_PLLERAYCON1_Bits.K1DIV */
#define IFX_SCU_PLLERAYCON1_K1DIV_MSK (0x7f)

/** \\brief  Offset for Ifx_SCU_PLLERAYCON1_Bits.K1DIV */
#define IFX_SCU_PLLERAYCON1_K1DIV_OFF (16)

/** \\brief  Length for Ifx_SCU_PLLERAYCON1_Bits.K2DIV */
#define IFX_SCU_PLLERAYCON1_K2DIV_LEN (7)

/** \\brief  Mask for Ifx_SCU_PLLERAYCON1_Bits.K2DIV */
#define IFX_SCU_PLLERAYCON1_K2DIV_MSK (0x7f)

/** \\brief  Offset for Ifx_SCU_PLLERAYCON1_Bits.K2DIV */
#define IFX_SCU_PLLERAYCON1_K2DIV_OFF (0)

/** \\brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.BY */
#define IFX_SCU_PLLERAYSTAT_BY_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.BY */
#define IFX_SCU_PLLERAYSTAT_BY_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.BY */
#define IFX_SCU_PLLERAYSTAT_BY_OFF (6)

/** \\brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.FINDIS */
#define IFX_SCU_PLLERAYSTAT_FINDIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.FINDIS */
#define IFX_SCU_PLLERAYSTAT_FINDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.FINDIS */
#define IFX_SCU_PLLERAYSTAT_FINDIS_OFF (3)

/** \\brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.K1RDY */
#define IFX_SCU_PLLERAYSTAT_K1RDY_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.K1RDY */
#define IFX_SCU_PLLERAYSTAT_K1RDY_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.K1RDY */
#define IFX_SCU_PLLERAYSTAT_K1RDY_OFF (4)

/** \\brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.K2RDY */
#define IFX_SCU_PLLERAYSTAT_K2RDY_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.K2RDY */
#define IFX_SCU_PLLERAYSTAT_K2RDY_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.K2RDY */
#define IFX_SCU_PLLERAYSTAT_K2RDY_OFF (5)

/** \\brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.PWDSTAT */
#define IFX_SCU_PLLERAYSTAT_PWDSTAT_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.PWDSTAT */
#define IFX_SCU_PLLERAYSTAT_PWDSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.PWDSTAT */
#define IFX_SCU_PLLERAYSTAT_PWDSTAT_OFF (1)

/** \\brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLERAYSTAT_VCOBYST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLERAYSTAT_VCOBYST_MSK (0x1)

