HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLERAYSTAT_VCOBYST_OFF (0)

/** \\brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLERAYSTAT_VCOLOCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLERAYSTAT_VCOLOCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLERAYSTAT_VCOLOCK_OFF (2)

/** \\brief  Length for Ifx_SCU_PLLSTAT_Bits.BY */
#define IFX_SCU_PLLSTAT_BY_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLSTAT_Bits.BY */
#define IFX_SCU_PLLSTAT_BY_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLSTAT_Bits.BY */
#define IFX_SCU_PLLSTAT_BY_OFF (6)

/** \\brief  Length for Ifx_SCU_PLLSTAT_Bits.FINDIS */
#define IFX_SCU_PLLSTAT_FINDIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLSTAT_Bits.FINDIS */
#define IFX_SCU_PLLSTAT_FINDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLSTAT_Bits.FINDIS */
#define IFX_SCU_PLLSTAT_FINDIS_OFF (3)

/** \\brief  Length for Ifx_SCU_PLLSTAT_Bits.K1RDY */
#define IFX_SCU_PLLSTAT_K1RDY_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLSTAT_Bits.K1RDY */
#define IFX_SCU_PLLSTAT_K1RDY_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLSTAT_Bits.K1RDY */
#define IFX_SCU_PLLSTAT_K1RDY_OFF (4)

/** \\brief  Length for Ifx_SCU_PLLSTAT_Bits.K2RDY */
#define IFX_SCU_PLLSTAT_K2RDY_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLSTAT_Bits.K2RDY */
#define IFX_SCU_PLLSTAT_K2RDY_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLSTAT_Bits.K2RDY */
#define IFX_SCU_PLLSTAT_K2RDY_OFF (5)

/** \\brief  Length for Ifx_SCU_PLLSTAT_Bits.MODRUN */
#define IFX_SCU_PLLSTAT_MODRUN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLSTAT_Bits.MODRUN */
#define IFX_SCU_PLLSTAT_MODRUN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLSTAT_Bits.MODRUN */
#define IFX_SCU_PLLSTAT_MODRUN_OFF (7)

/** \\brief  Length for Ifx_SCU_PLLSTAT_Bits.PWDSTAT */
#define IFX_SCU_PLLSTAT_PWDSTAT_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLSTAT_Bits.PWDSTAT */
#define IFX_SCU_PLLSTAT_PWDSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLSTAT_Bits.PWDSTAT */
#define IFX_SCU_PLLSTAT_PWDSTAT_OFF (1)

/** \\brief  Length for Ifx_SCU_PLLSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLSTAT_VCOBYST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLSTAT_VCOBYST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLSTAT_VCOBYST_OFF (0)

/** \\brief  Length for Ifx_SCU_PLLSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLSTAT_VCOLOCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_PLLSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLSTAT_VCOLOCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PLLSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLSTAT_VCOLOCK_OFF (2)

/** \\brief  Length for Ifx_SCU_PMCSR_Bits.PMST */
#define IFX_SCU_PMCSR_PMST_LEN (3)

/** \\brief  Mask for Ifx_SCU_PMCSR_Bits.PMST */
#define IFX_SCU_PMCSR_PMST_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_PMCSR_Bits.PMST */
#define IFX_SCU_PMCSR_PMST_OFF (8)

/** \\brief  Length for Ifx_SCU_PMCSR_Bits.REQSLP */
#define IFX_SCU_PMCSR_REQSLP_LEN (2)

/** \\brief  Mask for Ifx_SCU_PMCSR_Bits.REQSLP */
#define IFX_SCU_PMCSR_REQSLP_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_PMCSR_Bits.REQSLP */
#define IFX_SCU_PMCSR_REQSLP_OFF (0)

/** \\brief  Length for Ifx_SCU_PMCSR_Bits.RSTSLP */
#define IFX_SCU_PMCSR_RSTSLP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMCSR_Bits.RSTSLP */
#define IFX_SCU_PMCSR_RSTSLP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMCSR_Bits.RSTSLP */
#define IFX_SCU_PMCSR_RSTSLP_OFF (3)

/** \\brief  Length for Ifx_SCU_PMCSR_Bits.SMUSLP */
#define IFX_SCU_PMCSR_SMUSLP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMCSR_Bits.SMUSLP */
#define IFX_SCU_PMCSR_SMUSLP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMCSR_Bits.SMUSLP */
#define IFX_SCU_PMCSR_SMUSLP_OFF (2)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.DCDCSYNC */
#define IFX_SCU_PMSWCR0_DCDCSYNC_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.DCDCSYNC */
#define IFX_SCU_PMSWCR0_DCDCSYNC_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.DCDCSYNC */
#define IFX_SCU_PMSWCR0_DCDCSYNC_OFF (25)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR0DFEN */
#define IFX_SCU_PMSWCR0_ESR0DFEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR0DFEN */
#define IFX_SCU_PMSWCR0_ESR0DFEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR0DFEN */
#define IFX_SCU_PMSWCR0_ESR0DFEN_OFF (4)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR0EDCON */
#define IFX_SCU_PMSWCR0_ESR0EDCON_LEN (2)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR0EDCON */
#define IFX_SCU_PMSWCR0_ESR0EDCON_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR0EDCON */
#define IFX_SCU_PMSWCR0_ESR0EDCON_OFF (5)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR0WKEN */
#define IFX_SCU_PMSWCR0_ESR0WKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR0WKEN */
#define IFX_SCU_PMSWCR0_ESR0WKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR0WKEN */
#define IFX_SCU_PMSWCR0_ESR0WKEN_OFF (0)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR1DFEN */
#define IFX_SCU_PMSWCR0_ESR1DFEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR1DFEN */
#define IFX_SCU_PMSWCR0_ESR1DFEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR1DFEN */
#define IFX_SCU_PMSWCR0_ESR1DFEN_OFF (7)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR1EDCON */
#define IFX_SCU_PMSWCR0_ESR1EDCON_LEN (2)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR1EDCON */
#define IFX_SCU_PMSWCR0_ESR1EDCON_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR1EDCON */
#define IFX_SCU_PMSWCR0_ESR1EDCON_OFF (8)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR1WKEN */
#define IFX_SCU_PMSWCR0_ESR1WKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR1WKEN */
#define IFX_SCU_PMSWCR0_ESR1WKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR1WKEN */
#define IFX_SCU_PMSWCR0_ESR1WKEN_OFF (1)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.LCK */
#define IFX_SCU_PMSWCR0_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.LCK */
#define IFX_SCU_PMSWCR0_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.LCK */
#define IFX_SCU_PMSWCR0_LCK_OFF (31)

