HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINADFEN */
#define IFX_SCU_PMSWCR0_PINADFEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINADFEN */
#define IFX_SCU_PMSWCR0_PINADFEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINADFEN */
#define IFX_SCU_PMSWCR0_PINADFEN_OFF (10)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINAEDCON */
#define IFX_SCU_PMSWCR0_PINAEDCON_LEN (2)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINAEDCON */
#define IFX_SCU_PMSWCR0_PINAEDCON_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINAEDCON */
#define IFX_SCU_PMSWCR0_PINAEDCON_OFF (11)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINAWKEN */
#define IFX_SCU_PMSWCR0_PINAWKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINAWKEN */
#define IFX_SCU_PMSWCR0_PINAWKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINAWKEN */
#define IFX_SCU_PMSWCR0_PINAWKEN_OFF (2)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINBDFEN */
#define IFX_SCU_PMSWCR0_PINBDFEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINBDFEN */
#define IFX_SCU_PMSWCR0_PINBDFEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINBDFEN */
#define IFX_SCU_PMSWCR0_PINBDFEN_OFF (13)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINBEDCON */
#define IFX_SCU_PMSWCR0_PINBEDCON_LEN (2)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINBEDCON */
#define IFX_SCU_PMSWCR0_PINBEDCON_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINBEDCON */
#define IFX_SCU_PMSWCR0_PINBEDCON_OFF (14)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINBWKEN */
#define IFX_SCU_PMSWCR0_PINBWKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINBWKEN */
#define IFX_SCU_PMSWCR0_PINBWKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINBWKEN */
#define IFX_SCU_PMSWCR0_PINBWKEN_OFF (3)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_OFF (23)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PORSTWKP */
#define IFX_SCU_PMSWCR0_PORSTWKP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PORSTWKP */
#define IFX_SCU_PMSWCR0_PORSTWKP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PORSTWKP */
#define IFX_SCU_PMSWCR0_PORSTWKP_OFF (24)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_OFF (17)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.TRISTEN */
#define IFX_SCU_PMSWCR0_TRISTEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.TRISTEN */
#define IFX_SCU_PMSWCR0_TRISTEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.TRISTEN */
#define IFX_SCU_PMSWCR0_TRISTEN_OFF (21)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.TRISTREQ */
#define IFX_SCU_PMSWCR0_TRISTREQ_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.TRISTREQ */
#define IFX_SCU_PMSWCR0_TRISTREQ_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.TRISTREQ */
#define IFX_SCU_PMSWCR0_TRISTREQ_OFF (22)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.CPU0IDLE */
#define IFX_SCU_PMSWCR1_CPU0IDLE_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.CPU0IDLE */
#define IFX_SCU_PMSWCR1_CPU0IDLE_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.CPU0IDLE */
#define IFX_SCU_PMSWCR1_CPU0IDLE_OFF (8)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.CPU1IDLE */
#define IFX_SCU_PMSWCR1_CPU1IDLE_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.CPU1IDLE */
#define IFX_SCU_PMSWCR1_CPU1IDLE_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.CPU1IDLE */
#define IFX_SCU_PMSWCR1_CPU1IDLE_OFF (9)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.CPU2IDLE */
#define IFX_SCU_PMSWCR1_CPU2IDLE_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.CPU2IDLE */
#define IFX_SCU_PMSWCR1_CPU2IDLE_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.CPU2IDLE */
#define IFX_SCU_PMSWCR1_CPU2IDLE_OFF (10)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_LEN (3)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_OFF (24)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.LCK */
#define IFX_SCU_PMSWCR1_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.LCK */
#define IFX_SCU_PMSWCR1_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.LCK */
#define IFX_SCU_PMSWCR1_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.BUSY */
#define IFX_SCU_PMSWCR2_BUSY_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.BUSY */
#define IFX_SCU_PMSWCR2_BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.BUSY */
#define IFX_SCU_PMSWCR2_BUSY_OFF (8)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.LCK */
#define IFX_SCU_PMSWCR2_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.LCK */
#define IFX_SCU_PMSWCR2_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.LCK */
#define IFX_SCU_PMSWCR2_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.RST */
#define IFX_SCU_PMSWCR2_RST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.RST */
#define IFX_SCU_PMSWCR2_RST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.RST */
#define IFX_SCU_PMSWCR2_RST_OFF (26)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.SCRECC */
#define IFX_SCU_PMSWCR2_SCRECC_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.SCRECC */
#define IFX_SCU_PMSWCR2_SCRECC_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.SCRECC */
#define IFX_SCU_PMSWCR2_SCRECC_OFF (9)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.SCRINT */
#define IFX_SCU_PMSWCR2_SCRINT_LEN (8)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.SCRINT */
#define IFX_SCU_PMSWCR2_SCRINT_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.SCRINT */
#define IFX_SCU_PMSWCR2_SCRINT_OFF (0)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.SCRRST */
#define IFX_SCU_PMSWCR2_SCRRST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.SCRRST */
#define IFX_SCU_PMSWCR2_SCRRST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.SCRRST */
#define IFX_SCU_PMSWCR2_SCRRST_OFF (11)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.SCRWDT */
#define IFX_SCU_PMSWCR2_SCRWDT_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.SCRWDT */
#define IFX_SCU_PMSWCR2_SCRWDT_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.SCRWDT */
#define IFX_SCU_PMSWCR2_SCRWDT_OFF (10)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.SMURST */
#define IFX_SCU_PMSWCR2_SMURST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.SMURST */
#define IFX_SCU_PMSWCR2_SMURST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.SMURST */
#define IFX_SCU_PMSWCR2_SMURST_OFF (25)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.TCINT */
#define IFX_SCU_PMSWCR2_TCINT_LEN (8)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.TCINT */
#define IFX_SCU_PMSWCR2_TCINT_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.TCINT */
#define IFX_SCU_PMSWCR2_TCINT_OFF (16)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.TCINTREQ */
#define IFX_SCU_PMSWCR2_TCINTREQ_LEN (1)

