HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.TCINTREQ */
#define IFX_SCU_PMSWCR2_TCINTREQ_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.TCINTREQ */
#define IFX_SCU_PMSWCR2_TCINTREQ_OFF (24)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR0OVRUN */
#define IFX_SCU_PMSWSTAT_ESR0OVRUN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR0OVRUN */
#define IFX_SCU_PMSWSTAT_ESR0OVRUN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR0OVRUN */
#define IFX_SCU_PMSWSTAT_ESR0OVRUN_OFF (1)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR0WKP */
#define IFX_SCU_PMSWSTAT_ESR0WKP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR0WKP */
#define IFX_SCU_PMSWSTAT_ESR0WKP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR0WKP */
#define IFX_SCU_PMSWSTAT_ESR0WKP_OFF (0)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_OFF (3)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_OFF (2)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_LEN (3)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_OFF (10)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_OFF (5)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_OFF (4)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_OFF (7)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINBWKP */
#define IFX_SCU_PMSWSTAT_PINBWKP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINBWKP */
#define IFX_SCU_PMSWSTAT_PINBWKP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINBWKP */
#define IFX_SCU_PMSWSTAT_PINBWKP_OFF (6)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PORSTDF */
#define IFX_SCU_PMSWSTAT_PORSTDF_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PORSTDF */
#define IFX_SCU_PMSWSTAT_PORSTDF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PORSTDF */
#define IFX_SCU_PMSWSTAT_PORSTDF_OFF (9)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PORSTWKP */
#define IFX_SCU_PMSWSTAT_PORSTWKP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PORSTWKP */
#define IFX_SCU_PMSWSTAT_PORSTWKP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PORSTWKP */
#define IFX_SCU_PMSWSTAT_PORSTWKP_OFF (8)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.SPARE0 */
#define IFX_SCU_PMSWSTAT_SPARE0_LEN (5)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.SPARE0 */
#define IFX_SCU_PMSWSTAT_SPARE0_MSK (0x1f)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.SPARE0 */
#define IFX_SCU_PMSWSTAT_SPARE0_OFF (19)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.STBYRAM */
#define IFX_SCU_PMSWSTAT_STBYRAM_LEN (2)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.STBYRAM */
#define IFX_SCU_PMSWSTAT_STBYRAM_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.STBYRAM */
#define IFX_SCU_PMSWSTAT_STBYRAM_OFF (13)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.TRIST */
#define IFX_SCU_PMSWSTAT_TRIST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.TRIST */
#define IFX_SCU_PMSWSTAT_TRIST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.TRIST */
#define IFX_SCU_PMSWSTAT_TRIST_OFF (15)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.ESR0OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR0OVRUNCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.ESR0OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR0OVRUNCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.ESR0OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR0OVRUNCLR_OFF (1)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.ESR0WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR0WKPCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.ESR0WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR0WKPCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.ESR0WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR0WKPCLR_OFF (0)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1OVRUNCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1OVRUNCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1OVRUNCLR_OFF (3)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1WKPCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1WKPCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1WKPCLR_OFF (2)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINAOVRUNCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINAOVRUNCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINAOVRUNCLR_OFF (5)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINAWKPCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINAWKPCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINAWKPCLR_OFF (4)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINBOVRUNCLR_LEN (1)

