HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINBOVRUNCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINBOVRUNCLR_OFF (7)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINBWKPCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINBWKPCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINBWKPCLR_OFF (6)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.SPARECLR */
#define IFX_SCU_PMSWSTATCLR_SPARECLR_LEN (5)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.SPARECLR */
#define IFX_SCU_PMSWSTATCLR_SPARECLR_MSK (0x1f)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.SPARECLR */
#define IFX_SCU_PMSWSTATCLR_SPARECLR_OFF (19)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_OFF (1)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.CSS */
#define IFX_SCU_RSTCON2_CSS_LEN (3)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.CSS */
#define IFX_SCU_RSTCON2_CSS_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.CSS */
#define IFX_SCU_RSTCON2_CSS_OFF (12)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.FLSS */
#define IFX_SCU_RSTCON2_FLSS_LEN (2)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.FLSS */
#define IFX_SCU_RSTCON2_FLSS_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.FLSS */
#define IFX_SCU_RSTCON2_FLSS_OFF (10)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.FRTO */
#define IFX_SCU_RSTCON2_FRTO_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.FRTO */
#define IFX_SCU_RSTCON2_FRTO_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.FRTO */
#define IFX_SCU_RSTCON2_FRTO_OFF (0)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.MCDSSS */
#define IFX_SCU_RSTCON2_MCDSSS_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.MCDSSS */
#define IFX_SCU_RSTCON2_MCDSSS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.MCDSSS */
#define IFX_SCU_RSTCON2_MCDSSS_OFF (15)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_LEN (16)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_MSK (0xffff)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_OFF (16)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.ESR0 */
#define IFX_SCU_RSTCON_ESR0_LEN (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.ESR0 */
#define IFX_SCU_RSTCON_ESR0_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.ESR0 */
#define IFX_SCU_RSTCON_ESR0_OFF (0)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.ESR1 */
#define IFX_SCU_RSTCON_ESR1_LEN (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.ESR1 */
#define IFX_SCU_RSTCON_ESR1_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.ESR1 */
#define IFX_SCU_RSTCON_ESR1_OFF (2)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.SMU */
#define IFX_SCU_RSTCON_SMU_LEN (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.SMU */
#define IFX_SCU_RSTCON_SMU_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.SMU */
#define IFX_SCU_RSTCON_SMU_OFF (6)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_LEN (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_OFF (10)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_LEN (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_OFF (12)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_LEN (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_OFF (14)

/** \\brief  Length for Ifx_SCU_RSTCON_Bits.SW */
#define IFX_SCU_RSTCON_SW_LEN (2)

/** \\brief  Mask for Ifx_SCU_RSTCON_Bits.SW */
#define IFX_SCU_RSTCON_SW_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_RSTCON_Bits.SW */
#define IFX_SCU_RSTCON_SW_OFF (8)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.CB0 */
#define IFX_SCU_RSTSTAT_CB0_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.CB0 */
#define IFX_SCU_RSTSTAT_CB0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.CB0 */
#define IFX_SCU_RSTSTAT_CB0_OFF (18)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.CB1 */
#define IFX_SCU_RSTSTAT_CB1_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.CB1 */
#define IFX_SCU_RSTSTAT_CB1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.CB1 */
#define IFX_SCU_RSTSTAT_CB1_OFF (19)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.CB3 */
#define IFX_SCU_RSTSTAT_CB3_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.CB3 */
#define IFX_SCU_RSTSTAT_CB3_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.CB3 */
#define IFX_SCU_RSTSTAT_CB3_OFF (20)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.ESR0 */
#define IFX_SCU_RSTSTAT_ESR0_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.ESR0 */
#define IFX_SCU_RSTSTAT_ESR0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.ESR0 */
#define IFX_SCU_RSTSTAT_ESR0_OFF (0)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.ESR1 */
#define IFX_SCU_RSTSTAT_ESR1_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.ESR1 */
#define IFX_SCU_RSTSTAT_ESR1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.ESR1 */
#define IFX_SCU_RSTSTAT_ESR1_OFF (1)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.EVR13 */
#define IFX_SCU_RSTSTAT_EVR13_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.EVR13 */
#define IFX_SCU_RSTSTAT_EVR13_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.EVR13 */
#define IFX_SCU_RSTSTAT_EVR13_OFF (23)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.EVR33 */
#define IFX_SCU_RSTSTAT_EVR33_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.EVR33 */
#define IFX_SCU_RSTSTAT_EVR33_MSK (0x1)

