HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.EVR33 */
#define IFX_SCU_RSTSTAT_EVR33_OFF (24)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.HSMA */
#define IFX_SCU_RSTSTAT_HSMA_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.HSMA */
#define IFX_SCU_RSTSTAT_HSMA_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.HSMA */
#define IFX_SCU_RSTSTAT_HSMA_OFF (27)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.HSMS */
#define IFX_SCU_RSTSTAT_HSMS_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.HSMS */
#define IFX_SCU_RSTSTAT_HSMS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.HSMS */
#define IFX_SCU_RSTSTAT_HSMS_OFF (26)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.PORST */
#define IFX_SCU_RSTSTAT_PORST_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.PORST */
#define IFX_SCU_RSTSTAT_PORST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.PORST */
#define IFX_SCU_RSTSTAT_PORST_OFF (16)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.SMU */
#define IFX_SCU_RSTSTAT_SMU_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.SMU */
#define IFX_SCU_RSTSTAT_SMU_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.SMU */
#define IFX_SCU_RSTSTAT_SMU_OFF (3)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.STBYR */
#define IFX_SCU_RSTSTAT_STBYR_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.STBYR */
#define IFX_SCU_RSTSTAT_STBYR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.STBYR */
#define IFX_SCU_RSTSTAT_STBYR_OFF (28)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.STM0 */
#define IFX_SCU_RSTSTAT_STM0_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.STM0 */
#define IFX_SCU_RSTSTAT_STM0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.STM0 */
#define IFX_SCU_RSTSTAT_STM0_OFF (5)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.STM1 */
#define IFX_SCU_RSTSTAT_STM1_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.STM1 */
#define IFX_SCU_RSTSTAT_STM1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.STM1 */
#define IFX_SCU_RSTSTAT_STM1_OFF (6)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.STM2 */
#define IFX_SCU_RSTSTAT_STM2_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.STM2 */
#define IFX_SCU_RSTSTAT_STM2_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.STM2 */
#define IFX_SCU_RSTSTAT_STM2_OFF (7)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.SW */
#define IFX_SCU_RSTSTAT_SW_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.SW */
#define IFX_SCU_RSTSTAT_SW_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.SW */
#define IFX_SCU_RSTSTAT_SW_OFF (4)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.SWD */
#define IFX_SCU_RSTSTAT_SWD_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.SWD */
#define IFX_SCU_RSTSTAT_SWD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.SWD */
#define IFX_SCU_RSTSTAT_SWD_OFF (25)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.TCU */
#define IFX_SCU_RSTSTAT_TCU_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.TCU */
#define IFX_SCU_RSTSTAT_TCU_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.TCU */
#define IFX_SCU_RSTSTAT_TCU_OFF (22)

/** \\brief  Length for Ifx_SCU_RSTSTAT_Bits.TP */
#define IFX_SCU_RSTSTAT_TP_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTSTAT_Bits.TP */
#define IFX_SCU_RSTSTAT_TP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTSTAT_Bits.TP */
#define IFX_SCU_RSTSTAT_TP_OFF (21)

/** \\brief  Length for Ifx_SCU_STCON_Bits.CFCBAE */
#define IFX_SCU_STCON_CFCBAE_LEN (1)

/** \\brief  Mask for Ifx_SCU_STCON_Bits.CFCBAE */
#define IFX_SCU_STCON_CFCBAE_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STCON_Bits.CFCBAE */
#define IFX_SCU_STCON_CFCBAE_OFF (14)

/** \\brief  Length for Ifx_SCU_STCON_Bits.HWCFG */
#define IFX_SCU_STCON_HWCFG_LEN (8)

/** \\brief  Mask for Ifx_SCU_STCON_Bits.HWCFG */
#define IFX_SCU_STCON_HWCFG_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_STCON_Bits.HWCFG */
#define IFX_SCU_STCON_HWCFG_OFF (0)

/** \\brief  Length for Ifx_SCU_STCON_Bits.SFCBAE */
#define IFX_SCU_STCON_SFCBAE_LEN (1)

/** \\brief  Mask for Ifx_SCU_STCON_Bits.SFCBAE */
#define IFX_SCU_STCON_SFCBAE_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STCON_Bits.SFCBAE */
#define IFX_SCU_STCON_SFCBAE_OFF (13)

/** \\brief  Length for Ifx_SCU_STCON_Bits.STP */
#define IFX_SCU_STCON_STP_LEN (1)

/** \\brief  Mask for Ifx_SCU_STCON_Bits.STP */
#define IFX_SCU_STCON_STP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STCON_Bits.STP */
#define IFX_SCU_STCON_STP_OFF (15)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.FCBAE */
#define IFX_SCU_STSTAT_FCBAE_LEN (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.FCBAE */
#define IFX_SCU_STSTAT_FCBAE_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.FCBAE */
#define IFX_SCU_STSTAT_FCBAE_OFF (16)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.FSIOFF */
#define IFX_SCU_STSTAT_FSIOFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.FSIOFF */
#define IFX_SCU_STSTAT_FSIOFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.FSIOFF */
#define IFX_SCU_STSTAT_FSIOFF_OFF (22)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.HWCFG */
#define IFX_SCU_STSTAT_HWCFG_LEN (8)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.HWCFG */
#define IFX_SCU_STSTAT_HWCFG_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.HWCFG */
#define IFX_SCU_STSTAT_HWCFG_OFF (0)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.LUDIS */
#define IFX_SCU_STSTAT_LUDIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.LUDIS */
#define IFX_SCU_STSTAT_LUDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.LUDIS */
#define IFX_SCU_STSTAT_LUDIS_OFF (17)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.MODE */
#define IFX_SCU_STSTAT_MODE_LEN (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.MODE */
#define IFX_SCU_STSTAT_MODE_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.MODE */
#define IFX_SCU_STSTAT_MODE_OFF (15)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.OTPOFF */
#define IFX_SCU_STSTAT_OTPOFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.OTPOFF */
#define IFX_SCU_STSTAT_OTPOFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.OTPOFF */
#define IFX_SCU_STSTAT_OTPOFF_OFF (21)

