HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_STSTAT_Bits.RAMINT */
#define IFX_SCU_STSTAT_RAMINT_LEN (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.RAMINT */
#define IFX_SCU_STSTAT_RAMINT_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.RAMINT */
#define IFX_SCU_STSTAT_RAMINT_OFF (24)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.SPDEN */
#define IFX_SCU_STSTAT_SPDEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.SPDEN */
#define IFX_SCU_STSTAT_SPDEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.SPDEN */
#define IFX_SCU_STSTAT_SPDEN_OFF (20)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.STPOVREQ */
#define IFX_SCU_STSTAT_STPOVREQ_LEN (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.STPOVREQ */
#define IFX_SCU_STSTAT_STPOVREQ_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.STPOVREQ */
#define IFX_SCU_STSTAT_STPOVREQ_OFF (23)

/** \\brief  Length for Ifx_SCU_STSTAT_Bits.TRSTL */
#define IFX_SCU_STSTAT_TRSTL_LEN (1)

/** \\brief  Mask for Ifx_SCU_STSTAT_Bits.TRSTL */
#define IFX_SCU_STSTAT_TRSTL_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_STSTAT_Bits.TRSTL */
#define IFX_SCU_STSTAT_TRSTL_OFF (19)

/** \\brief  Length for Ifx_SCU_SWRSTCON_Bits.SWBOOT */
#define IFX_SCU_SWRSTCON_SWBOOT_LEN (1)

/** \\brief  Mask for Ifx_SCU_SWRSTCON_Bits.SWBOOT */
#define IFX_SCU_SWRSTCON_SWBOOT_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_SWRSTCON_Bits.SWBOOT */
#define IFX_SCU_SWRSTCON_SWBOOT_OFF (0)

/** \\brief  Length for Ifx_SCU_SWRSTCON_Bits.SWCFG */
#define IFX_SCU_SWRSTCON_SWCFG_LEN (8)

/** \\brief  Mask for Ifx_SCU_SWRSTCON_Bits.SWCFG */
#define IFX_SCU_SWRSTCON_SWCFG_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_SWRSTCON_Bits.SWCFG */
#define IFX_SCU_SWRSTCON_SWCFG_OFF (8)

/** \\brief  Length for Ifx_SCU_SWRSTCON_Bits.SWRSTREQ */
#define IFX_SCU_SWRSTCON_SWRSTREQ_LEN (1)

/** \\brief  Mask for Ifx_SCU_SWRSTCON_Bits.SWRSTREQ */
#define IFX_SCU_SWRSTCON_SWRSTREQ_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_SWRSTCON_Bits.SWRSTREQ */
#define IFX_SCU_SWRSTCON_SWRSTREQ_OFF (1)

/** \\brief  Length for Ifx_SCU_SYSCON_Bits.CCTRIG0 */
#define IFX_SCU_SYSCON_CCTRIG0_LEN (1)

/** \\brief  Mask for Ifx_SCU_SYSCON_Bits.CCTRIG0 */
#define IFX_SCU_SYSCON_CCTRIG0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_SYSCON_Bits.CCTRIG0 */
#define IFX_SCU_SYSCON_CCTRIG0_OFF (0)

/** \\brief  Length for Ifx_SCU_SYSCON_Bits.CCTRIG1 */
#define IFX_SCU_SYSCON_CCTRIG1_LEN (1)

/** \\brief  Mask for Ifx_SCU_SYSCON_Bits.CCTRIG1 */
#define IFX_SCU_SYSCON_CCTRIG1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_SYSCON_Bits.CCTRIG1 */
#define IFX_SCU_SYSCON_CCTRIG1_OFF (1)

/** \\brief  Length for Ifx_SCU_SYSCON_Bits.DATM */
#define IFX_SCU_SYSCON_DATM_LEN (1)

/** \\brief  Mask for Ifx_SCU_SYSCON_Bits.DATM */
#define IFX_SCU_SYSCON_DATM_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_SYSCON_Bits.DATM */
#define IFX_SCU_SYSCON_DATM_OFF (8)

/** \\brief  Length for Ifx_SCU_SYSCON_Bits.RAMINTM */
#define IFX_SCU_SYSCON_RAMINTM_LEN (2)

/** \\brief  Mask for Ifx_SCU_SYSCON_Bits.RAMINTM */
#define IFX_SCU_SYSCON_RAMINTM_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_SYSCON_Bits.RAMINTM */
#define IFX_SCU_SYSCON_RAMINTM_OFF (2)

/** \\brief  Length for Ifx_SCU_SYSCON_Bits.SETLUDIS */
#define IFX_SCU_SYSCON_SETLUDIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_SYSCON_Bits.SETLUDIS */
#define IFX_SCU_SYSCON_SETLUDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_SYSCON_Bits.SETLUDIS */
#define IFX_SCU_SYSCON_SETLUDIS_OFF (4)

/** \\brief  Length for Ifx_SCU_TRAPCLR_Bits.ESR0T */
#define IFX_SCU_TRAPCLR_ESR0T_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPCLR_Bits.ESR0T */
#define IFX_SCU_TRAPCLR_ESR0T_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPCLR_Bits.ESR0T */
#define IFX_SCU_TRAPCLR_ESR0T_OFF (0)

/** \\brief  Length for Ifx_SCU_TRAPCLR_Bits.ESR1T */
#define IFX_SCU_TRAPCLR_ESR1T_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPCLR_Bits.ESR1T */
#define IFX_SCU_TRAPCLR_ESR1T_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPCLR_Bits.ESR1T */
#define IFX_SCU_TRAPCLR_ESR1T_OFF (1)

/** \\brief  Length for Ifx_SCU_TRAPCLR_Bits.SMUT */
#define IFX_SCU_TRAPCLR_SMUT_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPCLR_Bits.SMUT */
#define IFX_SCU_TRAPCLR_SMUT_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPCLR_Bits.SMUT */
#define IFX_SCU_TRAPCLR_SMUT_OFF (3)

/** \\brief  Length for Ifx_SCU_TRAPDIS_Bits.ESR0T */
#define IFX_SCU_TRAPDIS_ESR0T_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS_Bits.ESR0T */
#define IFX_SCU_TRAPDIS_ESR0T_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS_Bits.ESR0T */
#define IFX_SCU_TRAPDIS_ESR0T_OFF (0)

/** \\brief  Length for Ifx_SCU_TRAPDIS_Bits.ESR1T */
#define IFX_SCU_TRAPDIS_ESR1T_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS_Bits.ESR1T */
#define IFX_SCU_TRAPDIS_ESR1T_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS_Bits.ESR1T */
#define IFX_SCU_TRAPDIS_ESR1T_OFF (1)

/** \\brief  Length for Ifx_SCU_TRAPDIS_Bits.SMUT */
#define IFX_SCU_TRAPDIS_SMUT_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPDIS_Bits.SMUT */
#define IFX_SCU_TRAPDIS_SMUT_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPDIS_Bits.SMUT */
#define IFX_SCU_TRAPDIS_SMUT_OFF (3)

/** \\brief  Length for Ifx_SCU_TRAPSET_Bits.ESR0T */
#define IFX_SCU_TRAPSET_ESR0T_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPSET_Bits.ESR0T */
#define IFX_SCU_TRAPSET_ESR0T_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSET_Bits.ESR0T */
#define IFX_SCU_TRAPSET_ESR0T_OFF (0)

/** \\brief  Length for Ifx_SCU_TRAPSET_Bits.ESR1T */
#define IFX_SCU_TRAPSET_ESR1T_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPSET_Bits.ESR1T */
#define IFX_SCU_TRAPSET_ESR1T_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSET_Bits.ESR1T */
#define IFX_SCU_TRAPSET_ESR1T_OFF (1)

/** \\brief  Length for Ifx_SCU_TRAPSET_Bits.SMUT */
#define IFX_SCU_TRAPSET_SMUT_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPSET_Bits.SMUT */
#define IFX_SCU_TRAPSET_SMUT_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSET_Bits.SMUT */
#define IFX_SCU_TRAPSET_SMUT_OFF (3)

/** \\brief  Length for Ifx_SCU_TRAPSTAT_Bits.ESR0T */
#define IFX_SCU_TRAPSTAT_ESR0T_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPSTAT_Bits.ESR0T */
#define IFX_SCU_TRAPSTAT_ESR0T_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSTAT_Bits.ESR0T */
#define IFX_SCU_TRAPSTAT_ESR0T_OFF (0)

/** \\brief  Length for Ifx_SCU_TRAPSTAT_Bits.ESR1T */
#define IFX_SCU_TRAPSTAT_ESR1T_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPSTAT_Bits.ESR1T */
#define IFX_SCU_TRAPSTAT_ESR1T_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSTAT_Bits.ESR1T */
#define IFX_SCU_TRAPSTAT_ESR1T_OFF (1)

/** \\brief  Length for Ifx_SCU_TRAPSTAT_Bits.SMUT */
#define IFX_SCU_TRAPSTAT_SMUT_LEN (1)

/** \\brief  Mask for Ifx_SCU_TRAPSTAT_Bits.SMUT */
#define IFX_SCU_TRAPSTAT_SMUT_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_TRAPSTAT_Bits.SMUT */
#define IFX_SCU_TRAPSTAT_SMUT_OFF (3)

/** \\brief  Length for Ifx_SCU_WDTCPU_CON0_Bits.ENDINIT */
#define IFX_SCU_WDTCPU_CON0_ENDINIT_LEN (1)

/** \\brief  Mask for Ifx_SCU_WDTCPU_CON0_Bits.ENDINIT */
#define IFX_SCU_WDTCPU_CON0_ENDINIT_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_WDTCPU_CON0_Bits.ENDINIT */
#define IFX_SCU_WDTCPU_CON0_ENDINIT_OFF (0)

/** \\brief  Length for Ifx_SCU_WDTCPU_CON0_Bits.LCK */
#define IFX_SCU_WDTCPU_CON0_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_WDTCPU_CON0_Bits.LCK */
#define IFX_SCU_WDTCPU_CON0_LCK_MSK (0x1)

